In [2]:
# 3-Filtering-inappropriate-values-01

In [3]:
# Sometimes, if you are working with data you didn't collect yourself,
# you need to worry about whether the data is accurate.
# Sometimes you need to worry about that even if you did collect it your self!
# It can be difficult to check the veracity of each and every data point,
# but it is quite easy to check if the data is appropriate.

In [15]:
# Python's pandas library has the abilit to filter out the bad values.

# Creaing a dataset
import numpy as np
import pandas as pd

names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,-2,77,78,101]
GradeList = list(zip(names,grades))
df = pd.DataFrame(data=GradeList, columns=['Names','Grades'])
df

     Names  Grades
0      Bob      76
1  Jessica      -2
2     Mary      77
3     John      78
4      Mel     101

In [17]:
# Filetering out impossible grades
# To eliminate all the rows where the grades are too high:
df1 = df.loc[df['Grades']<=100]
df1

     Names  Grades
0      Bob      76
1  Jessica      -2
2     Mary      77
3     John      78

In [23]:
# To change the out-of-boud values to the maximum or minimum allowed value:
# In the below code, if the grade value is >=100, then we are changing it to 100
# We can chang it to any pointwe want.
df.loc[(df['Grades']>=100,'Grades')]=100
df

     Names  Grades
0      Bob      76
1  Jessica      -2
2     Mary      77
3     John      78
4      Mel     100

In [26]:
# Example : if the grade point is more than 100, we are changing it to 90
df.loc[(df['Grades']>=90,"Grades")]=90
df

     Names  Grades
0      Bob      76
1  Jessica      -2
2     Mary      77
3     John      78
4      Mel      90

In [27]:
# using the dataset from this section, can you replace all the subzero grades with a gade of zero
df.loc[(df['Grades']<0,"Grades")]=0
df

     Names  Grades
0      Bob      76
1  Jessica       0
2     Mary      77
3     John      78
4      Mel      90